/*
 * 
 * 　　┏┓　　　┏┓+ +
 * 　┏┛┻━━━┛┻┓ + +
 * 　┃　　　　　　　┃ 　
 * 　┃　　　━　　　┃ ++ + + +
 *  ████━████ ┃+
 * 　┃　　　　　　　┃ +
 * 　┃　　　┻　　　┃
 * 　┃　　　　　　　┃ + +
 * 　┗━┓　　　┏━┛
 * 　　　┃　　　┃　　　　　　　　　　　
 * 　　　┃　　　┃ + + + +
 * 　　　┃　　　┃
 * 　　　┃　　　┃ +  神兽保佑
 * 　　　┃　　　┃    代码无bug　　
 * 　　　┃　　　┃　　+　　　　　　　　　
 * 　　　┃　 　　┗━━━┓ + +
 * 　　　┃ 　　　　　　　┣┓
 * 　　　┃ 　　　　　　　┏┛
 * 　　　┗┓┓┏━┳┓┏┛ + + + +
 * 　　　　┃┫┫　┃┫┫
 * 　　　　┗┻┛　┗┻┛+ + + +
 * 
 * 
 * 
 * ************Copyright 2022 MCD************
 * 
 * @version      : 
 * @Company      : HOPE
 * @Author       : MCD
 * @Date         : 2022-08-24 13:54:37
 * @LastEditors  : MCD
 * @LastEditTime : 2022-08-24 15:32:29
 * @FilePath     : /My_C_Test/DAJING_Modbus/haif_ adaptor.c
 * @Description  : HAI/F(Home Automation Interface) 家庭自动化接口
 * 
 * ******************************************
 */

#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <string.h>
#include <sys/wait.h>
#include <sys/types.h>
#include <signal.h>
#include <fcntl.h>
#include <errno.h>
#include <sys/stat.h>

/* 一个字符由开始位(0),8位数据位，奇偶校验位和停止位(1)组成。一个字符的大小始终是11位，根据有无奇偶校验位，停止位可为1位或者2位。 */
/* 无校验位 */
/* -------------------------------------------------------------- */
/* | 0(LSB) | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |    9    | 10(MSB) | */
/* -------------------------------------------------------------- */
/* | 开始位  |            数据位              | 停止位1  | 停止位2  | */
/* -------------------------------------------------------------- */

/* 有校验位 */
/* ----------------------------------------------------------------------- */
/* | 0(LSB) | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |        9         | 10(MSB) | */
/* ----------------------------------------------------------------------- */
/* | 开始位  |            数据位              | 校验位(奇数和偶数)  | 停止位2  | */
/* ----------------------------------------------------------------------- */

/* 每一帧的前后必须有延迟时间T1-T2-T3-T4，延迟时间取决于通信速度 */
/* ------------------------------ */
/* |  波特率(bps) | 9600 | 19200 | */
/* ------------------------------ */
/* | 延迟时间(ms) |   5   |  2.5  |*/
/* ------------------------------ */

/* 当HAI/F适配器接收到查询信息后，警告适配器的响应时间(t1)后响应信息。所以此适配器的响应时间(t1)为“延迟时间(T1-T2-T3-T4) + 20ms”。 */
/* 当Modbus主机接收一条响应信息来自HAI/F适配器，此时Modbus主机必须等待一个时间间隔(t2)在发送下一个查询时间。这个时间间隔(t2)一定要大于等于“延迟时间(T1-T2-T3-T4) + 20ms”。 */
/* -------------------------------------------------------------------------- */
/*  Modbus主机  | 查询信息 |                                   | 查询信息 |      */
/* -------------------------------------------------------------------------- */
/* HA I/F适配器 |         |          |   响应信息   |          |                */   
/*                       | <--t1--> |             | <--t2--> |                */
/*                   t1 = (T1-T2-T3-T4) + 20ms   t2 >= (T1-T2-T3-T4) + 20ms   */
/* -------------------------------------------------------------------------- */